performance/k6/conflict-small-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: reservation-load-test.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m15s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  00.8s/45.0s

running (0m01.9s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 01/10 VUs  01.8s/45.0s

running (0m02.9s), 01/10 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 01/10 VUs  02.8s/45.0s

running (0m03.9s), 02/10 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  03.8s/45.0s

running (0m04.9s), 02/10 VUs, 4 complete and 0 interrupted iterations
default   [  11% ] 02/10 VUs  04.8s/45.0s

running (0m05.9s), 02/10 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 02/10 VUs  05.8s/45.0s

running (0m06.9s), 02/10 VUs, 8 complete and 0 interrupted iterations
default   [  15% ] 02/10 VUs  06.8s/45.0s

running (0m07.9s), 03/10 VUs, 10 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  07.8s/45.0s

running (0m08.9s), 03/10 VUs, 13 complete and 0 interrupted iterations
default   [  20% ] 03/10 VUs  08.8s/45.0s

running (0m09.9s), 03/10 VUs, 16 complete and 0 interrupted iterations
default   [  22% ] 03/10 VUs  09.8s/45.0s

running (0m10.9s), 03/10 VUs, 19 complete and 0 interrupted iterations
default   [  24% ] 03/10 VUs  10.8s/45.0s

running (0m11.9s), 04/10 VUs, 22 complete and 0 interrupted iterations
default   [  26% ] 04/10 VUs  11.8s/45.0s

running (0m12.9s), 04/10 VUs, 26 complete and 0 interrupted iterations
default   [  28% ] 04/10 VUs  12.8s/45.0s

running (0m13.9s), 04/10 VUs, 30 complete and 0 interrupted iterations
default   [  31% ] 04/10 VUs  13.8s/45.0s

running (0m14.9s), 04/10 VUs, 33 complete and 0 interrupted iterations
default   [  33% ] 04/10 VUs  14.8s/45.0s

running (0m15.9s), 05/10 VUs, 37 complete and 0 interrupted iterations
default   [  35% ] 05/10 VUs  15.8s/45.0s

running (0m16.9s), 05/10 VUs, 42 complete and 0 interrupted iterations
default   [  37% ] 05/10 VUs  16.8s/45.0s

running (0m17.9s), 05/10 VUs, 47 complete and 0 interrupted iterations
default   [  40% ] 05/10 VUs  17.8s/45.0s

running (0m18.9s), 06/10 VUs, 52 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  18.8s/45.0s

running (0m19.9s), 06/10 VUs, 58 complete and 0 interrupted iterations
default   [  44% ] 06/10 VUs  19.8s/45.0s

running (0m20.9s), 06/10 VUs, 64 complete and 0 interrupted iterations
default   [  46% ] 06/10 VUs  20.8s/45.0s

running (0m21.9s), 07/10 VUs, 69 complete and 0 interrupted iterations
default   [  48% ] 07/10 VUs  21.8s/45.0s

running (0m22.9s), 07/10 VUs, 76 complete and 0 interrupted iterations
default   [  51% ] 07/10 VUs  22.8s/45.0s

running (0m23.9s), 07/10 VUs, 83 complete and 0 interrupted iterations
default   [  53% ] 07/10 VUs  23.8s/45.0s

running (0m24.9s), 08/10 VUs, 87 complete and 0 interrupted iterations
default   [  55% ] 08/10 VUs  24.8s/45.0s

running (0m25.9s), 08/10 VUs, 95 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  25.8s/45.0s

running (0m26.9s), 08/10 VUs, 103 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  26.8s/45.0s

running (0m27.9s), 09/10 VUs, 111 complete and 0 interrupted iterations
default   [  62% ] 09/10 VUs  27.8s/45.0s

running (0m28.9s), 09/10 VUs, 120 complete and 0 interrupted iterations
default   [  64% ] 09/10 VUs  28.8s/45.0s

running (0m29.9s), 09/10 VUs, 129 complete and 0 interrupted iterations
default   [  66% ] 09/10 VUs  29.8s/45.0s

running (0m30.9s), 10/10 VUs, 138 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  30.8s/45.0s

running (0m31.9s), 10/10 VUs, 148 complete and 0 interrupted iterations
default   [  71% ] 10/10 VUs  31.8s/45.0s

running (0m32.9s), 09/10 VUs, 158 complete and 0 interrupted iterations
default   [  73% ] 09/10 VUs  32.8s/45.0s

running (0m33.9s), 08/10 VUs, 167 complete and 0 interrupted iterations
default   [  75% ] 08/10 VUs  33.8s/45.0s

running (0m34.9s), 08/10 VUs, 175 complete and 0 interrupted iterations
default   [  77% ] 08/10 VUs  34.8s/45.0s

running (0m35.9s), 07/10 VUs, 181 complete and 0 interrupted iterations
default   [  80% ] 07/10 VUs  35.8s/45.0s

running (0m36.9s), 06/10 VUs, 188 complete and 0 interrupted iterations
default   [  82% ] 06/10 VUs  36.8s/45.0s

running (0m37.9s), 06/10 VUs, 194 complete and 0 interrupted iterations
default   [  84% ] 06/10 VUs  37.8s/45.0s

running (0m38.9s), 05/10 VUs, 200 complete and 0 interrupted iterations
default   [  86% ] 05/10 VUs  38.8s/45.0s

running (0m39.9s), 04/10 VUs, 205 complete and 0 interrupted iterations
default   [  88% ] 04/10 VUs  39.8s/45.0s

running (0m40.9s), 03/10 VUs, 209 complete and 0 interrupted iterations
default   [  91% ] 03/10 VUs  40.8s/45.0s

running (0m41.9s), 03/10 VUs, 212 complete and 0 interrupted iterations
default   [  93% ] 03/10 VUs  41.8s/45.0s

running (0m42.9s), 02/10 VUs, 214 complete and 0 interrupted iterations
default   [  95% ] 02/10 VUs  42.8s/45.0s

running (0m43.9s), 01/10 VUs, 216 complete and 0 interrupted iterations
default   [  97% ] 01/10 VUs  43.8s/45.0s

running (0m44.9s), 01/10 VUs, 217 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  44.8s/45.0s

running (0m45.9s), 01/10 VUs, 218 complete and 0 interrupted iterations
default ↓ [ 100% ] 01/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s

running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s


  █ THRESHOLDS 

    checks{type:login}
    ✓ 'rate>0.99' rate=100.00%

    checks{type:reserve_attempt}
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=28.83ms


  █ TOTAL RESULTS 

    checks_total.......: 661    14.352527/s
    checks_succeeded...: 34.03% 225 out of 661
    checks_failed......: 65.96% 436 out of 661

    ✓ login status is 200
    ✓ login token exists
    ✓ reserve attempt handled
    ✗ reserve status is 200
      ↳  0% — ✓ 1 / ✗ 218
    ✗ reservation id exists
      ↳  0% — ✓ 1 / ✗ 218
    ✓ pay status is 200
    ✓ payment marked paid

    CUSTOM
    reservation_attempts...........: 219    4.755225/s
    reserved_seat_conflicts........: 218    4.733511/s

    HTTP
    http_req_duration..............: avg=28.94ms min=20.99ms med=24.23ms max=382.62ms p(90)=28.1ms  p(95)=28.83ms
      { expected_response:true }...: avg=60.65ms min=28.35ms med=52.08ms max=101.52ms p(90)=91.63ms p(95)=96.58ms
    http_req_failed................: 98.64% 218 out of 221
    http_reqs......................: 221    4.798651/s

    EXECUTION
    iteration_duration.............: avg=1.04s   min=1.02s   med=1.04s   max=1.39s    p(90)=1.05s   p(95)=1.05s  
    iterations.....................: 219    4.755225/s
    vus............................: 1      min=1          max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 83 kB  1.8 kB/s
    data_sent......................: 75 kB  1.6 kB/s



running (0m46.1s), 00/10 VUs, 219 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  45s